# 4. 판다스 데이터 쿼리 처리

### 간단한 데이터베이스 사용

In [1]:
import sqlite3

### 판다스 모듈 사용

In [2]:
import pandas as pd

## 4-1 기본 테이블 확인하기

### 데이터베이스 경로 지정

In [3]:
path = "../data/beat.db"

### 데이터베이스 컨넥션 생성

In [4]:
con = sqlite3.connect(path)

### 데이터베이스 내부의 테이블 확인

In [5]:
pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table';", con)

   name
0  Band

### 테이블 데이터 조회하기

In [6]:
pd.read_sql_query("SELECT * FROM Band;", con)

   id fname      lname  birthyear
0   0  Paul  McCartney       1942
1   1  John     Lennon       1940

## 4-2 다양한 테이블 확인하기

### 데이터베이스 확인

In [7]:
path1 = "../data/chinook.db"

### 데이터베이스 컨넥션

In [8]:
con1 = sqlite3.connect(path1)

### 데이터베이스 내의 테이블 확인

In [9]:
df_table = pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table';", con1)

In [10]:
df_table

               name
0            albums
1   sqlite_sequence
2           artists
3         customers
4         employees
5            genres
6          invoices
7     invoice_items
8       media_types
9         playlists
10   playlist_track
11           tracks
12     sqlite_stat1

### 테이블 내의 스키마 정보 확인

In [11]:
for x in df_table['name'] :
    df = pd.read_sql_query(f"SELECT * FROM {x};", con1)
    print(df.info())
    print("="*40)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 347 entries, 0 to 346
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   AlbumId   347 non-null    int64
 1   Title     347 non-null    object
 2   ArtistId  347 non-null    int64
dtypes: int64(2), object(1)
memory usage: 8.3+ KB
None
========================================
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    10 non-null     object
 1   seq     10 non-null     int64
dtypes: int64(1), object(1)
memory usage: 288.0+ bytes
None
========================================
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 275 entries, 0 to 274
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ArtistId  275 non-null    int64
 1   Name      275 non-null    object
dtypes: int64(1), object(1)
memory usage: 4.4+ KB
None
========================================
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 59 entries, 0 to 58
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CustomerId    59 non-null     int64
 1   FirstName     59 non-null     object
 2   LastName      59 non-null     object
 3   Company       10 non-null     object
 4   Address       59 non-null     object
 5   City          59 non-null     object
 6   State         30 non-null     object
 7   Country       59 non-null     object
 8   PostalCode    55 non-null     object
 9   Phone         58 non-null     object
 10  Fax           12 non-null     object
 11  Email         59 non-null     object
 12  SupportRepId  59 non-null     int64
dtypes: int64(2), object(11)
memory usage: 6.1+ KB
None
========================================
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 15 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EmployeeId  8 non-null      int64
 1   LastName    8 non-null      object
 2   FirstName   8 non-null      object
 3   Title       8 non-null      object
 4   ReportsTo   7 non-null      float64
 5   BirthDate   8 non-null      object
 6   HireDate    8 non-null      object
 7   Address     8 non-null      object
 8   City        8 non-null      object
 9   State       8 non-null      object
 10  Country     8 non-null      object
 11  PostalCode  8 non-null      object
 12  Phone       8 non-null      object
 13  Fax         8 non-null      object
 14  Email       8 non-null      object
dtypes: float64(1), int64(1), object(13)
memory usage: 1.1+ KB
None
========================================
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   GenreId  25 non-null     int64
 1   Name     25 non-null     object
dtypes: int64(1), object(1)
memory usage: 528.0+ bytes
None
========================================
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 412 entries, 0 to 411
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   InvoiceId          412 non-null    int64
 1   CustomerId         412 non-null    int64
 2   InvoiceDate        412 non-null    object
 3   BillingAddress     412 non-null    object
 4   BillingCity        412 non-null    object
 5   BillingState       210 non-null    object
 6   BillingCountry     412 non-null    object
 7   BillingPostalCode  384 non-null    object
 8   Total              412 non-null    float64
dtypes: float64(1), int64(2), object(6)
memory usage: 29.1+ KB
None
========================================
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   InvoiceLineId  2240 non-null   int64
 1   InvoiceId      2240 non-null   int64
 2   TrackId        2240 non-null   int64
 3   UnitPrice      2240 non-null   float64
 4   Quantity       2240 non-null   int64
dtypes: float64(1), int64(4)
memory usage: 87.6 KB
None
========================================
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   MediaTypeId  5 non-null      int64
 1   Name         5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes
None
========================================
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   PlaylistId  18 non-null     int64
 1   Name        18 non-null     object
dtypes: int64(1), object(1)
memory usage: 416.0+ bytes
None
========================================
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8715 entries, 0 to 8714
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   PlaylistId  8715 non-null   int64
 1   TrackId     8715 non-null   int64
dtypes: int64(2)
memory usage: 136.3 KB
None
========================================
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3503 entries, 0 to 3502
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   TrackId       3503 non-null   int64
 1   Name          3503 non-null   object
 2   AlbumId       3503 non-null   int64
 3   MediaTypeId   3503 non-null   int64
 4   GenreId       3503 non-null   int64
 5   Composer      2525 non-null   object
 6   Milliseconds  3503 non-null   int64
 7   Bytes         3503 non-null   int64
 8   UnitPrice     3503 non-null   float64
dtypes: float64(1), int64(6), object(2)
memory usage: 246.4+ KB
None
========================================
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   tbl     15 non-null     object
 1   idx     11 non-null     object
 2   stat    15 non-null     object
dtypes: object(3)
memory usage: 488.0+ bytes
None
========================================

### 테이블 조회

In [12]:
df_albums = pd.read_sql_query("SELECT * FROM albums;", con1)

In [13]:
df_albums.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 347 entries, 0 to 346
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   AlbumId   347 non-null    int64
 1   Title     347 non-null    object
 2   ArtistId  347 non-null    int64
dtypes: int64(2), object(1)
memory usage: 8.3+ KB

### 특정 건수를 읽어오기  : sql

In [14]:
sql_1 = "select * from albums limit 5"

In [15]:
pd.read_sql_query(sql_1, con1)

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

### 특정 건수를 읽어오기  : pandas 메서드 사용

In [16]:
df_albums.head()

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

### 마지막 부분 조회하기

In [17]:
sql_2 = "select * from albums order by AlbumId Desc limit 5"

In [18]:
pd.read_sql_query(sql_2, con1)

   AlbumId                                              Title  ArtistId
0      347  Koyaanisqatsi (Soundtrack from the Motion Pict...       275
1      346                              Mozart: Chamber Music       274
2      345                                Monteverdi: L'Orfeo       273
3      344  Schubert: The Late String Quartets & String Qu...       272
4      343                             Respighi:Pines of Rome       226

In [19]:
df_albums.tail()

     AlbumId                                              Title  ArtistId
342      343                             Respighi:Pines of Rome       226
343      344  Schubert: The Late String Quartets & String Qu...       272
344      345                                Monteverdi: L'Orfeo       273
345      346                              Mozart: Chamber Music       274
346      347  Koyaanisqatsi (Soundtrack from the Motion Pict...       275

### 다른 테이블 조회

In [20]:
df_artists = pd.read_sql_query("SELECT * FROM artists;", con1)

In [21]:
df_artists.head()

   ArtistId               Name
0         1              AC/DC
1         2             Accept
2         3          Aerosmith
3         4  Alanis Morissette
4         5    Alice In Chains

## 4-3 데이터 조인 처리 

-  두 테이블을 결합해서 하나의 테이블로 처리
- 특정 키 값이 같아야 한다.

### 조인쿼리 만들기 : from과 where절 사용 처리

In [22]:
sql_j01 = """
select AlbumId,Title, al.ArtistId, Name 
from albums as al, artists as ar 
where al.ArtistId = ar.ArtistId;
"""

### 쿼리 실행하기

In [23]:
df_join = pd.read_sql_query(sql_j01, con1)

In [24]:
df_join.shape

(347, 4)

In [25]:
df_join.head()

   AlbumId                                  Title  ArtistId       Name
0        1  For Those About To Rock We Salute You         1      AC/DC
1        2                      Balls to the Wall         2     Accept
2        3                      Restless and Wild         2     Accept
3        4                      Let There Be Rock         1      AC/DC
4        5                               Big Ones         3  Aerosmith

### 조인하기 : join 쿼리 사용하기

In [26]:
sql_j02 = """
select AlbumId,Title, al.ArtistId, Name 
from albums as al
inner join artists as ar
on al.ArtistId = ar.ArtistId;
"""

In [27]:
df_join_02 = pd.read_sql_query(sql_j02, con1)

In [28]:
df_join_02.head()

   AlbumId                                  Title  ArtistId       Name
0        1  For Those About To Rock We Salute You         1      AC/DC
1        2                      Balls to the Wall         2     Accept
2        3                      Restless and Wild         2     Accept
3        4                      Let There Be Rock         1      AC/DC
4        5                               Big Ones         3  Aerosmith

## 4-4 서브쿼리 사용하기

### 위드구분으로 서브퀄를 만들고 사용하기

In [29]:
sql_with = """
With cte as
(SELECT * from Artists )
Select name from cte
"""

In [30]:
pd.read_sql_query(sql_with, con1)

                                                  Name
0                                                AC/DC
1                                               Accept
2                                            Aerosmith
3                                    Alanis Morissette
4                                      Alice In Chains
..                                                 ...
270   Mela Tenenbaum, Pro Musica Prague & Richard Kapp
271                             Emerson String Quartet
272  C. Monteverdi, Nigel Rogers - Chiaroscuro; Lon...
273                                      Nash Ensemble
274                              Philip Glass Ensemble

[275 rows x 1 columns]

In [31]:
### 서브 쿼리를 만들어서 처리하기

In [32]:
sql_sub = """
SELECT * FROM
(SELECT * FROM Artists) AS Art 
ORDER BY 1 DESC
"""

In [33]:
pd.read_sql_query(sql_sub, con1)

     ArtistId                                               Name
0         275                              Philip Glass Ensemble
1         274                                      Nash Ensemble
2         273  C. Monteverdi, Nigel Rogers - Chiaroscuro; Lon...
3         272                             Emerson String Quartet
4         271   Mela Tenenbaum, Pro Musica Prague & Richard Kapp
..        ...                                                ...
270         5                                    Alice In Chains
271         4                                  Alanis Morissette
272         3                                          Aerosmith
273         2                                             Accept
274         1                                              AC/DC

[275 rows x 2 columns]